local Unit = require "Core.Entity.Unit"


-- unitType 打包器会将excel中的对应单位类型的键值对全部合并入这里
--@param unit_type_str 仅支持字母和数字，首字母大写为英雄，小写和数字为单位
--@param unit_type_config 不填则使用默认值
Unit.unitType("Boss", {
    ["名字"] = "张三",
    ["称谓"] = "贼帮首领",
    ["模型"] = "units\\human\\HeroPaladin\\HeroPaladin",
    ["图标"] = "ReplaceableTextures\\CommandButtons\\BTNHeroPaladin.blp",
    ["投射物模型"] = "Abilities\\Weapons\\FireBallMissile\\FireBallMissile.mdl",
    --[[
    csv = {
        ["攻击类型"] = "物理",
        ["种族"] = "人族",
        ["等级"] = 1,
        ["施法前摇"] = "0.300",
        ["施法后摇"] = "0.510",
        ["攻击前摇"] = "0.500",
        ["攻击后摇"] = "0.500",
        ["攻击距离"] = "90",
        ["攻击间隔"] = "1.35",
        ["体魄"] = "10",
        ["身法"] = "10",
        ["元神"] = "10",
        ["攻击"] = "11",
        ["主要属性"] = "体魄",
        ["体魄成长"] = "2.00",
        ["身法成长"] = "2.00",
        ["元神成长"] = "2.00",
        ["护甲"] = "2.00",
        ["生命"] = "HP",
        ["法力"] = "manaN",
        ["生命恢复"] = "regenHP",
        ["法力恢复"] = "regenMana",
        ["固定移速"] = "270",
        ["模型缩放"] = 1.00,
        ["碰撞体积"] = 32.00,
        ["移动类型"] = "foot",
        ["转身速度"] = 0.50,
        ["高度"] = 0.00,
        ["动画-跑步速度"] = 210,
        ["动画-行走速度"] = 210,
        ["动画-混合时间"] = 0.15,
        ["主动攻击范围"] = 500.00,
        ["小地图隐藏"] = 1,
        ["死亡时间"] = 3.00,
        ["装甲类型"] = "金属",
        ["武器声音"] = "金属中切",
        ["目标允许"] = "ground,enemies,air",
        ["作为目标类型"] = "ground",
        ["死亡类型"] = 3,
        ["射弹弧度"] = 0.15,
        ["射弹速度"] = 900,
    }
    --]]
})
